// Задача 2. Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// Console.WriteLine("Введи первое число");
// int num1 = int.Parse(Console.ReadLine()!);
// Console.WriteLine("Введи второе число");
// int num2 = int.Parse(Console.ReadLine()!);
// if (num1 > num2)
// {
//     Console.WriteLine($"max = {num1}");
// }
// else
// {
//     Console.WriteLine($"max = {num2}");
// }

// Задача 4. Напишите программу, которая на вход принимает три числа и выдаёт максимальное
// Console.WriteLine("Введи первое число");
// int num1 = int.Parse(Console.ReadLine()!);
// Console.WriteLine("Введи второе число");
// int num2 = int.Parse(Console.ReadLine()!);
// Console.WriteLine("Введи третье число");
// int num3 = int.Parse(Console.ReadLine()!);
// if (num1 > num2)
// {
//     if (num1 > num3) Console.WriteLine($"max = {num1} максимальное первое");
// }

// if (num2 > num1)
// {
//     if (num2 > num3) Console.WriteLine($"max = {num2} максимальное второе");
// }
// if (num3 > num1)
// {
//     if (num3 > num2) Console.WriteLine($"max = {num3} максимальное третье");
// }

// Задача 6. Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// Console.WriteLine("Введи число");
// int num = int.Parse(Console.ReadLine()!);
// if (num % 2 == 0)
// {
//     Console.WriteLine($"{num} это четное число");
// }
// else
// {
//     Console.WriteLine($"{num} это нечетное число");
// }

// Задача 8. Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N. 
// Console.WriteLine("Введи число");
// int n = int.Parse(Console.ReadLine()!);
// int x = 1;
// while (x <= n)
// {
//     if (x % 2 == 0) Console.Write($"{x}, ");
//     x ++;
// }